7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
#include <Arduino.h>
#include <DHT.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>

static_assert(sizeof(unsigned long) == sizeof(uint32_t), "unsigned long (would return by millis) is not 32 bit");

#include "root.html.h"
#include "snippet/compConst.h"

COMPCONST char const ConfigHostName[] = PRIVATE_HOSTNAME;
COMPCONST char const ConfigWiFiSSID[] = PRIVATE_WIFI_SSID;
COMPCONST char const ConfigWiFiPassword[] = PRIVATE_WIFI_PASSWORD;
COMPCONST unsigned long const ConfigBaudRate = 115200;

COMPCONST char const ErrorStringWouldTruncate[] PROGMEM = "String Would Truncate";
COMPCONST char const ErrorStringFormatFailure[] PROGMEM = "String Format Failure";
COMPCONST char const ErrorNotFound[] PROGMEM = "Not Found";
COMPCONST char const PcPowerOk[] PROGMEM = "Power button pulse sent";
COMPCONST char const PcResetOk[] PROGMEM = "Reset button pulse sent";

COMPCONST unsigned long const OneSecondAsMs = 1'000;
COMPCONST uint8_t const MaxWaits = 20;
COMPCONST uint8_t const PcPinPower =
#ifdef PRIVATE_PIN_POWER
PRIVATE_PIN_POWER
#else
D1
#endif
;
COMPCONST uint8_t const PcPinReset =
#ifdef PRIVATE_PIN_RESET
PRIVATE_PIN_RESET
#else
D2
#endif
;
static DHT dht(
#ifdef PRIVATE_PIN_DHT11
PRIVATE_PIN_DHT11
#else
D4
#endif
, DHT11);
static ESP8266WebServer server(80);
#include "snippet/sharedBuffer.h"

#define serverSendError(x) server.send_P(500, "text/plain", Error ## x, sizeof(Error ## x) - 1)

struct UpTimer {
  COMPCONST uint32_t const MillisSafeMax = UINT32_MAX - OneSecondAsMs;

  uint32_t secondsOffset = 0;
  uint32_t millisOffset = 0;
  uint32_t millisLast = 0;

  uint32_t currentMillis() {
    uint32_t const millisCurrent = millis();

    if (millisCurrent < millisLast) { /* overflow */
      /* UINT32_MAX = 0xFFFFFFFF = 4294967295 */
      secondsOffset += 4294967;
      millisOffset += 295;
      while (millisOffset >= OneSecondAsMs) {
        millisOffset -= OneSecondAsMs;
        secondsOffset += 1;
      }
    }
    millisLast = millisCurrent;
    return millisCurrent;
  }

  uint32_t upSeconds(uint32_t const millisCurrent) const {
    return secondsOffset + (millisCurrent + (millisCurrent > MillisSafeMax ? 0 : millisOffset)) / OneSecondAsMs;
  }
};

static UpTimer upTimer = {};

struct WiFiKeeper {
  COMPCONST size_t const WantedLen = sizeof(ConfigWiFiSSID) - 1;
  COMPCONST uint8_t const BssidSize = 6;
  /*
     0 ... 15 seconds : no reconnect
    15 ...    seconds : reconnect with current setup
    60 ...    seconds : reconnect with current setup, then rescan
  */
  COMPCONST uint32_t const ThresholdDisconnect = 15000;
  COMPCONST uint32_t const ThresholdReconnect = ThresholdDisconnect;
  COMPCONST uint32_t const ThresholdScan = 60000;

  uint8_t bssid[BssidSize] = {};
  uint8_t bssidLength = 0;
  uint8_t channel = 0;
  bool connected = false;
  uint32_t millisDisconnect = 0;
  uint32_t millisConnect = 0;
  uint32_t millisScan = 0;

  void beginChosen(uint32_t const millisCurrent) {
    Serial.printf("Connecting to ch %" PRIu8 " @ " MACSTR "\n", channel, MAC2STR(bssid));
    WiFi.begin(ConfigWiFiSSID, ConfigWiFiPassword, channel, bssidLength == BssidSize ? bssid : nullptr);
    millisConnect = millisCurrent;
  }

  bool scanChoose(uint32_t const millisCurrent) {
    bss_info const *info;
    int8_t countNetworks, i;
    int32_t bestRSSI = INT32_MIN;

    Serial.println("Scanning network...");
    countNetworks = WiFi.scanNetworks();
    if (countNetworks <= 0) {
      Serial.println("No network discovered");
      return false;
    }
    Serial.printf("Discovered %" PRId8 " networks, filtering\n", countNetworks);
    for (i = 0; i < countNetworks; ++i) {
      info = WiFi.getScanInfoByIndex(i);
      if (!info) {
        continue;
      }
      Serial.printf(
        "[%02" PRId8 "] %-20.*s (" MACSTR ") %5" PRId8 " dBm @ ch %" PRIu8 "\n",
        i,
        int(info->ssid_len), reinterpret_cast<char const *>(info->ssid),
        MAC2STR(info->bssid),
        info->rssi, info->channel
      );
      if (info->ssid_len != WantedLen || memcmp(info->ssid, ConfigWiFiSSID, WantedLen)) {
        continue;
      }
      if (info->rssi > bestRSSI) {
        if (bestRSSI == INT32_MIN) {
          Serial.println(" => FOUND");
        } else {
          Serial.println(" => REPLACE");
        }
        bestRSSI = info->rssi;
        channel = info->channel;
        bssidLength = BssidSize;
        memcpy(bssid, info->bssid, BssidSize);
      } else {
        Serial.println(" => BYPASS");
      }
    }
    WiFi.scanDelete();
    if (bestRSSI == INT32_MIN || !bssidLength) {
      Serial.println("Did not find any matching network");
      return false;
    }
    Serial.printf("Chose target AP on ch %" PRIu8 " @ " MACSTR "\n", channel, MAC2STR(bssid));
    millisScan = millisCurrent;
    return true;
  }

  void markConnected() {
    if (!connected) {
      Serial.print("WiFi IP: ");
      Serial.print(WiFi.localIP());
      Serial.print(" / ");
      Serial.print(WiFi.subnetMask());
      Serial.print(", Gateway: ");
      Serial.println(WiFi.gatewayIP());
    }
    connected = true;
    millisDisconnect = 0;
  }

  void init(uint32_t const millisCurrent) {
    for (;;) {
      if (scanChoose(millisCurrent)) {
        beginChosen(millisCurrent);
        for (uint8_t i = 0; i < MaxWaits; ++i) {
          if (WiFi.status() == WL_CONNECTED) {
            markConnected();
            return;
          }
          delay(500);
        }
      }
      Serial.println("Failed to connect, restart scanning process after 1 second");
      delay(OneSecondAsMs);
    }
  }

  void maybeReconnect(uint32_t const millisCurrent) {
    if (WiFi.status() == WL_CONNECTED) {
      markConnected();
      return;
    }
    if (connected) {
      Serial.println("WiFi disconnected");
      connected = false;
      millisDisconnect = millisCurrent;
    }
    if (millisCurrent - millisDisconnect < ThresholdDisconnect) {
      return;
    }
    if (millisCurrent - millisConnect >= ThresholdReconnect) {
      Serial.println("WiFi still disconnected, retrying saved AP");
      WiFi.reconnect();
      millisConnect = millisCurrent;
      delay(500);
      if (WiFi.status() == WL_CONNECTED) {
        return;
      }
    }
    if (millisCurrent - millisScan >= ThresholdScan) {
      Serial.println("WiFi still disconnected, rescanning target AP");
      if (scanChoose(millisCurrent)) {
        beginChosen(millisCurrent);
        return;
      }
    }
  }
};

static WiFiKeeper wifiKeeper = {};

struct NtpSyncer {
  COMPCONST uint32_t const MinInterval = 3600000UL;
  COMPCONST uint32_t const NtpUnixOffset = 2208988800UL;
  COMPCONST uint32_t const MinUnixOffset = 1776133834UL; /* Tue Apr 14 11:00:01 CST 2026, no specific reason */
  COMPCONST uint32_t const MinNtp = NtpUnixOffset + MinUnixOffset;
  COMPCONST size_t const BufferSize = 48;
  COMPCONST uint16_t const NtpPortRemote = 123;
  COMPCONST uint8_t const OffsetSecs = 40;
  COMPCONST uint8_t const OffsetFrac = 44;
  COMPCONST byte const NtpMagic = 0b11100011;

  COMPCONST char NtpServer[] =
#ifdef PRIVATE_NTP_SERVER
    PRIVATE_NTP_SERVER
#else
    "pool.ntp.org"
#endif
      ;
  COMPCONST uint16_t const NtpPortLocal =
#ifdef PRIVATE_NTP_LOCAL_PORT
    PRIVATE_NTP_LOCAL_PORT
#else
    7931 /* This is chosen simply randomly */
#endif
      ;

  IPAddress serverIP;
  WiFiUDP udp;
  uint32_t millisLast;
  uint32_t requestToken = 0;
  bool init, isIP;

  uint64_t unixOffset = MinUnixOffset;
  uint64_t unixLast = MinUnixOffset;

  static uint32_t BEu32At(byte const *const data) {
    return (uint32_t(data[0]) << 24) |
           (uint32_t(data[1]) << 16) |
           (uint32_t(data[2]) << 8) |
            uint32_t(data[3]);
  }

  static void BEu32To(byte *const data, uint32_t const value) {
    data[0] = value >> 24;
    data[1] = value >> 16;
    data[2] = value >> 8;
    data[3] = value;
  }

  void discard(size_t size) {
    int discarded;

    while (size > 0) {
      discarded = udp.read(sharedBytesBuffer, size > BufferSize ? BufferSize : size);
      if (discarded <= 0 || size_t(discarded) >= size) {
        return;
      }
      size -= discarded;
    }
  }

  void update(uint32_t millisCurrent) {
    uint8_t i;
    uint32_t ntpOffset, requestSecs, requestFrac;
    uint64_t candidateUnixNow;
    int packetSize;

